; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   green_block_1 black_block_1 black_block_2 yellow_block_1 white_block_1 black_block_3 black_block_4 - block
 )
 (:init (ontable green_block_1) (ontable black_block_1) (ontable black_block_2) (on yellow_block_1 green_block_1) (on white_block_1 black_block_2) (on black_block_3 white_block_1) (on black_block_4 black_block_3) (clear black_block_1) (clear yellow_block_1) (clear black_block_4) (handempty) (= (total-cost) 0))
 (:goal (and (ontable white_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack black_block_4 black_block_3)
   deleted: (on black_block_4 black_block_3) (clear black_block_4) (handempty)
   added: (holding black_block_4) (clear black_block_3)
   goals met: 0 of 1
2. (putdown black_block_4)
   deleted: (holding black_block_4)
   added: (clear black_block_4) (handempty) (ontable black_block_4)
   goals met: 0 of 1
3. (unstack black_block_3 white_block_1)
   deleted: (on black_block_3 white_block_1) (clear black_block_3) (handempty)
   added: (holding black_block_3) (clear white_block_1)
   goals met: 0 of 1
4. (putdown black_block_3)
   deleted: (holding black_block_3)
   added: (clear black_block_3) (handempty) (ontable black_block_3)
   goals met: 0 of 1
5. (unstack white_block_1 black_block_2)
   deleted: (on white_block_1 black_block_2) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear black_block_2)
   goals met: 0 of 1
6. (putdown white_block_1)
   deleted: (holding white_block_1)
   added: (clear white_block_1) (handempty) (ontable white_block_1)
   goals met: 1 of 1
